`Question1`. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
# Answer
import pandas as pd
s = pd.Series([4,8,15,16,23,24])
print(s)

0     4
1     8
2    15
3    16
4    23
5    24
dtype: int64

`Question 2` Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
# Answer
import pandas as pd

my_list = ['apple', 'banana', 'cherry', 'date', 'elderberry', 'fig', 'grape', 'honeydew', 'imbe', 'jackfruit']
my_series = pd.Series(my_list)

print(my_series)

0         apple
1        banana
2        cherry
3          date
4    elderberry
5           fig
6         grape
7      honeydew
8          imbe
9     jackfruit
dtype: object

`Question3` Create a Pandas DataFrame that contains the following data:

In [14]:
# Answer
import pandas as pd

data = {"Name" : ['Alice' ,'Bob' ,'Claire'],
        "Age": [25, 30, 27],
        "Gender": ["Female", "Male", "Female"]
       }
pd.DataFrame.from_dict(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

`Question 4`. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

`Answer` : In Pandas, a DataFrame is a 2-dimensional labeled data structure that is used to store and manipulate tabular data. It is similar to a spreadsheet or a SQL table, where rows represent individual observations, and columns represent the variables or features of the data.

A Pandas Series, on the other hand, is a 1-dimensional labeled array that can hold any data type such as integers, floats, strings, etc. It is similar to a column in a spreadsheet or a field in a database table.

Here's an example to illustrate the differences between a Pandas DataFrame and a Series:

In [7]:
# Answer
import pandas as pd

# creating a Series
my_series = pd.Series([4, 8, 15, 16, 23, 42], name='numbers')

print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
Name: numbers, dtype: int64

In [9]:
# creating a DataFrame
my_data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
           'age': [25, 32, 19, 47, 31],
           'gender': ['female', 'male', 'male', 'male', 'female']}

my_dataframe = pd.DataFrame.from_dict(my_data)

print(my_dataframe)

      name  age  gender
0    Alice   25  female
1      Bob   32    male
2  Charlie   19    male
3    David   47    male
4     Emma   31  female

`Questionn 5`. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

`Answer`:There are many built-in functions available in Pandas to manipulate data in a DataFrame. Some of the most common ones include:

1. head() and tail(): These functions allow you to view the top or bottom N rows of a DataFrame, respectively. This can be useful when you want to get a quick overview of the data.

2. describe(): This function generates a statistical summary of the DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values for each column. This can be useful when you want to get a quick sense of the distribution of the data.

3. sort_values(): This function allows you to sort the DataFrame by one or more columns. This can be useful when you want to order the data based on a certain variable.

4. groupby(): This function allows you to group the DataFrame by one or more columns and apply a function to each group. This can be useful when you want to aggregate data based on a certain variable.

5. pivot_table(): This function allows you to create a pivot table from the DataFrame, which is a way of summarizing and aggregating data in a tabular format. This can be useful when you want to see how different variables are related to each other.

6. apply(): This function allows you to apply a function to each element of a DataFrame. This can be useful when you want to transform the data in some way.

In [15]:
import pandas as pd

# create a DataFrame
data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
        'age': [25, 32, 19, 47, 31],
        'gender': ['female', 'male', 'male', 'male', 'female'],
        'salary': [50000, 75000, 40000, 100000, 60000]}

df = pd.DataFrame(data)

In [16]:
df

      name  age  gender  salary
0    Alice   25  female   50000
1      Bob   32    male   75000
2  Charlie   19    male   40000
3    David   47    male  100000
4     Emma   31  female   60000

In [21]:
df.dtypes

name      object
age        int64
gender    object
salary     int64
dtype: object

In [22]:
df.describe()

            age         salary
count   5.00000       5.000000
mean   30.80000   65000.000000
std    10.44988   23452.078799
min    19.00000   40000.000000
25%    25.00000   50000.000000
50%    31.00000   60000.000000
75%    32.00000   75000.000000
max    47.00000  100000.000000

In [23]:
df.columns

Index(['name', 'age', 'gender', 'salary'], dtype='object')

In [24]:
# Adding new column to table
df['Married'] = ["Yes","No","Yes","No","Yes"]

In [25]:
df

      name  age  gender  salary Married
0    Alice   25  female   50000     Yes
1      Bob   32    male   75000      No
2  Charlie   19    male   40000     Yes
3    David   47    male  100000      No
4     Emma   31  female   60000     Yes

In [26]:
df["salary"].max()

100000

`Question 6`. Which of the following is mutable in nature Series, DataFrame, Panel?

`Answer`; In Pandas, both Series and DataFrame are mutable in nature, meaning their values can be changed after creation. However, Panel is an immutable data structure in Pandas, which means that its values cannot be changed after creation.

Note that starting from version 0.25, the Panel data structure has been deprecated and users are recommended to use multi-dimensional NumPy arrays or Xarray instead.

`Question 7`. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
import pandas as pd

# create Series for name, age, and gender
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David', 'Emma'])
ages = pd.Series([25, 32, 19, 47, 31])
genders = pd.Series(['female', 'male', 'male', 'male', 'female'])
salary = pd.Series([50000, 75000, 40000, 100000, 60000])
kids = pd.Series([1, 2, 0, 3, 4])
married = pd.Series(["Yes", "No", "Yes", "No", "Yes"])

# create a dictionary of Series
data = {'name': names, 'age': ages, 'gender': genders, 'Salary': salary, 'Kids':kids, 'Married': married }

# create a DataFrame from the dictionary
df1 = pd.DataFrame(data)

In [33]:
df1

      name  age  gender  Salary  Kids Married
0    Alice   25  female   50000     1     Yes
1      Bob   32    male   75000     2      No
2  Charlie   19    male   40000     0     Yes
3    David   47    male  100000     3      No
4     Emma   31  female   60000     4     Yes

`Completed.....`